*** Settings ***
Library    SeleniumLibrary
Resource    ../Resource/shopping-cart-keywords.robot
Test Teardown    ปิดหน้าเบราเซอร์

*** Test Cases ***
ซื้อสินค้าราคาน้อยกว่ายอดขั้นต่ำที่คูปองกำหนดและคูปองยังถูกใช้ไม่ครบจำนวน
    [Tags]    Not Implement    Fail Case    Coupon Feature    
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    เลือกสินค้า    34
    แสดงรายละเอียดสินค้า     Lego Set C    Lego    140
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190
    ใส่คูปองส่วนลด    BLACKVAL05
    แสดงข้อความ    ไม่สามารถร่วมการนี้ได้
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190

ซื้อสินค้าราคาน้อยกว่ายอดขั้นต่ำที่คูปองกำหนดและคูปองที่ใช้เป็นใบสุดท้าย
    [Tags]    Not Implement    Fail Case    Coupon Feature    
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    เลือกสินค้า    34
    แสดงรายละเอียดสินค้า     Lego Set C    Lego    140
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190
    ใส่คูปองส่วนลด    BLACKVAL06
    แสดงข้อความ    ไม่สามารถร่วมการนี้ได้
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190

ซื้อสินค้าราคาน้อยกว่ายอดขั้นต่ำที่คูปองกำหนดและคูปองถูกไปจนครบจำนวนแล้ว
    [Tags]    Not Implement    Fail Case    Coupon Feature    
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    เลือกสินค้า    34
    แสดงรายละเอียดสินค้า     Lego Set C    Lego    140
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190
    ใส่คูปองส่วนลด    BLACKVAL07
    แสดงข้อความ    ไม่สามารถร่วมการนี้ได้
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set C    Lego    140    0   50    190

ซื้อสินค้าราคาเท่ากับยอดขั้นต่ำที่คูปองกำหนดและคูปองถูกไปจนครบจำนวนแล้ว
    [Tags]    Not Implement    Fail Case    Coupon Feature    
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    เลือกสินค้า    32
    แสดงรายละเอียดสินค้า     Lego Set A    Lego    150
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set A    Lego    150    0   50    200
    ใส่คูปองส่วนลด    BLACKVAL08
    แสดงข้อความ    ไม่สามารถร่วมการนี้ได้
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set A    Lego    150    0   50    200

ซื้อสินค้าราคามากกว่ายอดขั้นต่ำที่คูปองกำหนดและคูปองถูกไปจนครบจำนวนแล้ว
    [Tags]    Not Implement    Fail Case    Coupon Feature    
    เข้าหน้าแสดงรายการสินค้า พบรายการสินค้าทั้งหมด
    เลือกสินค้า    33 
    แสดงรายละเอียดสินค้า     Lego Set B    CoolKidz    350
    เพิ่มสินค้าเข้าตะกร้า
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set B    Lego    350    0   50    400
    ใส่คูปองส่วนลด    VALENTINE04
    แสดงข้อความ    คูปองนี้ถูกใช้งานเต็มจำนวนแล้ว
    แสดงรายการสินค้าที่อยู่ในตะกร้าสินค้าและมีราคารวมค่าสินค้าดังนี้    Lego Set B    Lego    350    0   50    400
